app/models/property.rb

  def self.create_from_collection(properties)
    properties.each do |property_hash, i|
      Property.create(property_hash)
---
INSERT INTO "properties" ("address", "price", "size", "description", "date_listed", "created_at", "updated_at", "url") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"